iarsystems/ewarm-nxp-example-projects/LPC54xxx/LPC54xxx/LPCXpresso54608/middleware/sdmmc_2.1.2/inc/fsl_specification.h
/*! @brief Data error token mask */
#define SDSPI_DATA_ERROR_TOKEN_MASK (0xFU)
/*! @brief Data Error Token mask bit */
enum _sdspi_data_error_token
{
    kSDSPI_DataErrorTokenError = (1U << 0U),               /*!< Data error */
    kSDSPI_DataErrorTokenCardControllerError = (1U << 1U), /*!< Card controller error */
    kSDSPI_DataErrorTokenCardEccFailed = (1U << 2U),       /*!< Card ecc error */
    kSDSPI_DataErrorTokenOutOfRange = (1U << 3U),          /*!< Out of range */
};

/*! @brief Data Token */
typedef enum _sdspi_data_token
{
    kSDSPI_DataTokenBlockRead = 0xFEU,          /*!< Single block read, multiple block read */
    kSDSPI_DataTokenSingleBlockWrite = 0xFEU,   /*!< Single block write */
    kSDSPI_DataTokenMultipleBlockWrite = 0xFCU, /*!< Multiple block write */
    kSDSPI_DataTokenStopTransfer = 0xFDU,       /*!< Stop transmission */
} sdspi_data_token_t;

/* Data Response Token mask */
#define SDSPI_DATA_RESPONSE_TOKEN_MASK (0x1FU) /*!< Mask for data response bits */
/*! @brief Data Response Token */
typedef enum _sdspi_data_response_token
{
    kSDSPI_DataResponseTokenAccepted = 0x05U,   /*!< Data accepted */
    kSDSPI_DataResponseTokenCrcError = 0x0BU,   /*!< Data rejected due to CRC error */
    kSDSPI_DataResponseTokenWriteError = 0x0DU, /*!< Data rejected due to write error */
} sdspi_data_response_token_t;

/*! @brief SD card individual commands */
typedef enum _sd_command
{
    kSD_SendRelativeAddress = 3U,    /*!< Send Relative Address */
    kSD_Switch = 6U,                 /*!< Switch Function */
    kSD_SendInterfaceCondition = 8U, /*!< Send Interface Condition */
    kSD_VoltageSwitch = 11U,         /*!< Voltage Switch */
    kSD_SpeedClassControl = 20U,     /*!< Speed Class control */
    kSD_EraseWriteBlockStart = 32U,  /*!< Write Block Start */
    kSD_EraseWriteBlockEnd = 33U,    /*!< Write Block End */
} sd_command_t;

/*! @brief SD card individual application commands */
typedef enum _sd_application_command
{
    kSD_ApplicationSetBusWdith = 6U,              /*!< Set Bus Width */
    kSD_ApplicationStatus = 13U,                  /*!< Send SD status */
    kSD_ApplicationSendNumberWriteBlocks = 22U,   /*!< Send Number Of Written Blocks */
    kSD_ApplicationSetWriteBlockEraseCount = 23U, /*!< Set Write Block Erase Count */
    kSD_ApplicationSendOperationCondition = 41U,  /*!< Send Operation Condition */
    kSD_ApplicationSetClearCardDetect = 42U,      /*!< Set Connnect/Disconnect pull up on detect pin */
    kSD_ApplicationSendScr = 51U,                 /*!< Send Scr */
} sd_application_command_t;

/*! @brief SD/MMC card common commands */
typedef enum _sdmmc_command
{
    kSDMMC_GoIdleState = 0U,         /*!< Go Idle State */
    kSDMMC_AllSendCid = 2U,          /*!< All Send CID */
    kSDMMC_SetDsr = 4U,              /*!< Set DSR */
    kSDMMC_SelectCard = 7U,          /*!< Select Card */
    kSDMMC_SendCsd = 9U,             /*!< Send CSD */
    kSDMMC_SendCid = 10U,            /*!< Send CID */
    kSDMMC_StopTransmission = 12U,   /*!< Stop Transmission */
    kSDMMC_SendStatus = 13U,         /*!< Send Status */
    kSDMMC_GoInactiveState = 15U,    /*!< Go Inactive State */
    kSDMMC_SetBlockLength = 16U,     /*!< Set Block Length */
    kSDMMC_ReadSingleBlock = 17U,    /*!< Read Single Block */
    kSDMMC_ReadMultipleBlock = 18U,  /*!< Read Multiple Block */
    kSDMMC_SendTuningBlock = 19U,    /*!< Send Tuning Block */
    kSDMMC_SetBlockCount = 23U,      /*!< Set Block Count */
    kSDMMC_WriteSingleBlock = 24U,   /*!< Write Single Block */
    kSDMMC_WriteMultipleBlock = 25U, /*!< Write Multiple Block */
    kSDMMC_ProgramCsd = 27U,         /*!< Program CSD */
    kSDMMC_SetWriteProtect = 28U,    /*!< Set Write Protect */
    kSDMMC_ClearWriteProtect = 29U,  /*!< Clear Write Protect */
    kSDMMC_SendWriteProtect = 30U,   /*!< Send Write Protect */
    kSDMMC_Erase = 38U,              /*!< Erase */
    kSDMMC_LockUnlock = 42U,         /*!< Lock Unlock */
    kSDMMC_ApplicationCommand = 55U, /*!< Send Application Command */
    kSDMMC_GeneralCommand = 56U,     /*!< General Purpose Command */
    kSDMMC_ReadOcr = 58U,            /*!< Read OCR */
} sdmmc_command_t;

/*! @brief MMC card individual commands */
typedef enum _mmc_command
{
    kMMC_SendOperationCondition = 1U, /*!< Send Operation Condition */
    kMMC_SetRelativeAddress = 3U,     /*!< Set Relative Address */
    kMMC_SleepAwake = 5U,             /*!< Sleep Awake */
    kMMC_Switch = 6U,                 /*!< Switch */
    kMMC_SendExtendedCsd = 8U,        /*!< Send EXT_CSD */
    kMMC_ReadDataUntilStop = 11U,     /*!< Read Data Until Stop */
    kMMC_BusTestRead = 14U,           /*!< Test Read */
    kMMC_WriteDataUntilStop = 20U,    /*!< Write Data Until Stop */
    kMMC_ProgramCid = 26U,            /*!< Program CID */
    kMMC_EraseGroupStart = 35U,       /*!< Erase Group Start */
    kMMC_EraseGroupEnd = 36U,         /*!< Erase Group End */
    kMMC_FastInputOutput = 39U,       /*!< Fast IO */
    kMMC_GoInterruptState = 40U,      /*!< Go interrupt State */
} mmc_command_t;

/*! @brief sdio card cccr register addr */
enum _sdio_cccr_reg
{
    kSDIO_RegCCCRSdioVer = 0x00U,      /*!< CCCR & SDIO version*/
    kSDIO_RegSDVersion = 0x01U,        /*!< SD version */
    kSDIO_RegIOEnable = 0x02U,         /*!< io enable register */
    kSDIO_RegIOReady = 0x03U,          /*!< io ready register */
    kSDIO_RegIOIntEnable = 0x04U,      /*!< io interrupt enable register */
    kSDIO_RegIOIntPending = 0x05U,     /*!< io interrupt pending register */
    kSDIO_RegIOAbort = 0x06U,          /*!< io abort register */
    kSDIO_RegBusInterface = 0x07U,     /*!< bus interface register */
    kSDIO_RegCardCapability = 0x08U,   /*!< card capability register */
    kSDIO_RegCommonCISPointer = 0x09U, /*!< common CIS pointer register */
    kSDIO_RegBusSuspend = 0x0C,        /*!< bus suspend register */
    kSDIO_RegFunctionSelect = 0x0DU,   /*!< function select register */
    kSDIO_RegExecutionFlag = 0x0EU,    /*!< execution flag register */
    kSDIO_RegReadyFlag = 0x0FU,        /*!< ready flag register */
    kSDIO_RegFN0BlockSizeLow = 0x10U,  /*!< FN0 block size register */
    kSDIO_RegFN0BlockSizeHigh = 0x11U, /*!< FN0 block size register */
    kSDIO_RegPowerControl = 0x12U,     /*!< power control register */
    kSDIO_RegHighSpeed = 0x13U,        /*!< high speed register */
};

/*! @brief sdio card individual commands */
typedef enum _sdio_command
{
    kSDIO_SendRelativeAddress = 3U,    /*!< send relative address */
    kSDIO_SendOperationCondition = 5U, /*!< send operation condition */
    kSDIO_SendInterfaceCondition = 8U, /*!< send interface condition */
    kSDIO_RWIODirect = 52U,            /*!< read/write IO direct command */
    kSDIO_RWIOExtended = 53U,          /*!< read/write IO extended command */
} sdio_command_t;

/*! @brief sdio card individual commands */
typedef enum _sdio_func_num
{
    kSDIO_FunctionNum0,   /*!< sdio function0*/
    kSDIO_FunctionNum1,   /*!< sdio function1*/
    kSDIO_FunctionNum2,   /*!< sdio function2*/
    kSDIO_FunctionNum3,   /*!< sdio function3*/
    kSDIO_FunctionNum4,   /*!< sdio function4*/
    kSDIO_FunctionNum5,   /*!< sdio function5*/
    kSDIO_FunctionNum6,   /*!< sdio function6*/
    kSDIO_FunctionNum7,   /*!< sdio function7*/
    kSDIO_FunctionMemory, /*!< for combo card*/
} sdio_func_num_t;

#define SDIO_CMD_ARGUMENT_RW_POS (31U)             /*!< read/write flag position */
#define SDIO_CMD_ARGUMENT_FUNC_NUM_POS (28U)       /*!< function number position */
#define SDIO_DIRECT_CMD_ARGUMENT_RAW_POS (27U)     /*!< direct raw flag position */
#define SDIO_CMD_ARGUMENT_REG_ADDR_POS (9U)        /*!< direct reg addr position */
#define SDIO_CMD_ARGUMENT_REG_ADDR_MASK (0x1FFFFU) /*!< direct reg addr mask */
#define SDIO_DIRECT_CMD_DATA_MASK (0xFFU)          /*!< data mask */

#define SDIO_EXTEND_CMD_ARGUMENT_BLOCK_MODE_POS (27U) /*!< extended command argument block mode bit position */
#define SDIO_EXTEND_CMD_ARGUMENT_OP_CODE_POS (26U)    /*!< extended command argument OP Code bit position */
#define SDIO_EXTEND_CMD_BLOCK_MODE_MASK (0x08000000U) /*!< block mode mask */
#define SDIO_EXTEND_CMD_OP_CODE_MASK (0x04000000U)    /*!< op code mask */
#define SDIO_EXTEND_CMD_COUNT_MASK (0x1FFU)           /*!< byte/block count mask */
#define SDIO_MAX_BLOCK_SIZE (2048U)                   /*!< max block size */
#define SDIO_FBR_BASE(x) (x * 0x100U)                 /*!< function basic register */
#define SDIO_TPL_CODE_END (0xFFU)                     /*!< tuple end */
#define SDIO_TPL_CODE_MANIFID (0x20U)                 /*!< manufacturer ID */
#define SDIO_TPL_CODE_FUNCID (0x21U)                  /*!< function ID */
#define SDIO_TPL_CODE_FUNCE (0x22U)                   /*!< function extension tuple*/
/*! @brief sdio command response flag */
enum _sdio_status_flag
{
    kSDIO_StatusCmdCRCError = 0x8000U,      /*!< the CRC check of the previous cmd fail*/
    kSDIO_StatusIllegalCmd = 0x4000U,       /*!< cmd illegal for the card state */
    kSDIO_StatusR6Error = 0x2000U,          /*!< special for R6 error status */
    kSDIO_StatusError = 0x0800U,            /*!< A general or an unknown error occurred */
    kSDIO_StatusFunctionNumError = 0x0200U, /*!< invail function error */
    kSDIO_StatusOutofRange = 0x0100U,       /*!<  cmd argument was out of the allowed range*/
};

/*! @brief sdio operation condition flag */
enum _sdio_ocr_flag
{
    kSDIO_OcrPowerUpBusyFlag = (1U << 31U), /*!< Power up busy status */
    kSDIO_OcrIONumber = (7U << 28U),        /*!< number of IO function */
    kSDIO_OcrMemPresent = (1U << 27U),      /*!< memory present flag */

    kSDIO_OcrVdd20_21Flag = (1U << 8U),  /*!< VDD 2.0-2.1 */
    kSDIO_OcrVdd21_22Flag = (1U << 9U),  /*!< VDD 2.1-2.2 */
    kSDIO_OcrVdd22_23Flag = (1U << 10U), /*!< VDD 2.2-2.3 */
    kSDIO_OcrVdd23_24Flag = (1U << 11U), /*!< VDD 2.3-2.4 */
    kSDIO_OcrVdd24_25Flag = (1U << 12U), /*!< VDD 2.4-2.5 */
    kSDIO_OcrVdd25_26Flag = (1U << 13U), /*!< VDD 2.5-2.6 */
    kSDIO_OcrVdd26_27Flag = (1U << 14U), /*!< VDD 2.6-2.7 */
    kSDIO_OcrVdd27_28Flag = (1U << 15U), /*!< VDD 2.7-2.8 */
    kSDIO_OcrVdd28_29Flag = (1U << 16U), /*!< VDD 2.8-2.9 */
    kSDIO_OcrVdd29_30Flag = (1U << 17U), /*!< VDD 2.9-3.0 */
    kSDIO_OcrVdd30_31Flag = (1U << 18U), /*!< VDD 2.9-3.0 */
    kSDIO_OcrVdd31_32Flag = (1U << 19U), /*!< VDD 3.0-3.1 */
    kSDIO_OcrVdd32_33Flag = (1U << 20U), /*!< VDD 3.1-3.2 */
    kSDIO_OcrVdd33_34Flag = (1U << 21U), /*!< VDD 3.2-3.3 */
    kSDIO_OcrVdd34_35Flag = (1U << 22U), /*!< VDD 3.3-3.4 */
    kSDIO_OcrVdd35_36Flag = (1U << 23U), /*!< VDD 3.4-3.5 */

