iarsystems/ewarm-nxp-example-projects/LPC54xxx/LPC54xxx/LPCXpresso54608/middleware/sdmmc_2.1.2/inc/fsl_specification.h
/*! @brief MMC card CSD register flags */
enum _mmc_csd_flag
{
    kMMC_CsdReadBlockPartialFlag = (1U << 0U),         /*!< Partial blocks for read allowed */
    kMMC_CsdWriteBlockMisalignFlag = (1U << 1U),       /*!< Write block misalignment */
    kMMC_CsdReadBlockMisalignFlag = (1U << 2U),        /*!< Read block misalignment */
    kMMC_CsdDsrImplementedFlag = (1U << 3U),           /*!< DSR implemented */
    kMMC_CsdWriteProtectGroupEnabledFlag = (1U << 4U), /*!< Write protect group enabled */
    kMMC_CsdWriteBlockPartialFlag = (1U << 5U),        /*!< Partial blocks for write allowed */
    kMMC_ContentProtectApplicationFlag = (1U << 6U),   /*!< Content protect application */
    kMMC_CsdFileFormatGroupFlag = (1U << 7U),          /*!< File format group */
    kMMC_CsdCopyFlag = (1U << 8U),                     /*!< Copy flag */
    kMMC_CsdPermanentWriteProtectFlag = (1U << 9U),    /*!< Permanent write protection */
    kMMC_CsdTemporaryWriteProtectFlag = (1U << 10U),   /*!< Temporary write protection */
};

/*! @brief Extended CSD register access mode(Access mode in CMD6). */
typedef enum _mmc_extended_csd_access_mode
{
    kMMC_ExtendedCsdAccessModeCommandSet = 0U, /*!< Command set related setting */
    kMMC_ExtendedCsdAccessModeSetBits = 1U,    /*!< Set bits in specific byte in Extended CSD  */
    kMMC_ExtendedCsdAccessModeClearBits = 2U,  /*!< Clear bits in specific byte in Extended CSD */
    kMMC_ExtendedCsdAccessModeWriteBits = 3U,  /*!< Write a value to specific byte in Extended CSD */
} mmc_extended_csd_access_mode_t;

/*! @brief EXT CSD byte index */
typedef enum _mmc_extended_csd_index
{
    kMMC_ExtendedCsdIndexEraseGroupDefinition = 175U, /*!< Erase Group Def */
    kMMC_ExtendedCsdIndexBootBusWidth = 177U,         /*!< Boot Bus Width */
    kMMC_ExtendedCsdIndexBootConfig = 179U,           /*!< Boot Config */
    kMMC_ExtendedCsdIndexBusWidth = 183U,             /*!< Bus Width */
    kMMC_ExtendedCsdIndexHighSpeedTiming = 185U,      /*!< High-speed Timing */
    kMMC_ExtendedCsdIndexPowerClass = 187U,           /*!< Power Class */
    kMMC_ExtendedCsdIndexCommandSet = 191U,           /*!< Command Set */
} mmc_extended_csd_index_t;

/*! @brief The length of Extended CSD register, unit as bytes. */
#define MMC_EXTENDED_CSD_BYTES (512U)

/*! @brief MMC card default relative address */
#define MMC_DEFAULT_RELATIVE_ADDRESS (2U)

/*! @brief SD card product name length united as bytes. */
#define SD_PRODUCT_NAME_BYTES (5U)

/*! @brief sdio card FBR register */
typedef struct _sdio_fbr
{
    uint8_t flags;             /*!< current io flags */
    uint8_t ioStdFunctionCode; /*!< current io standard function code */
    uint8_t ioExtFunctionCode; /*!< current io extended function code*/
    uint32_t ioPointerToCIS;   /*!< current io pointer to CIS */
    uint32_t ioPointerToCSA;   /*!< current io pointer to CSA*/
    uint16_t ioBlockSize;      /*!< current io block size */
} sdio_fbr_t;

/*! @brief sdio card common CIS  */
typedef struct _sdio_common_cis
{
    /* manufacturer identification string tuple */
    uint16_t mID;   /*!< manufacturer code */
    uint16_t mInfo; /*!< manufacturer information */

    /*function identification tuple */
    uint8_t funcID; /*!< function ID */

    /* function extension tuple */
    uint16_t fn0MaxBlkSize; /*!< function 0 max block size */
    uint8_t maxTransSpeed;  /*!< max data transfer speed for all function */

} sdio_common_cis_t;

/*! @brief sdio card function CIS  */
typedef struct _sdio_func_cis
{
    /*function identification tuple */
    uint8_t funcID; /*!< function ID */

    /* function extension tuple */
    uint8_t funcInfo;        /*!< function info */
    uint8_t ioVersion;       /*!< level of application specification this io support */
    uint32_t cardPSN;        /*!< product serial number */
    uint32_t ioCSASize;      /*!< avaliable CSA size for io  */
    uint8_t ioCSAProperty;   /*!< CSA property */
    uint16_t ioMaxBlockSize; /*!< io max transfer data size */
    uint32_t ioOCR;          /*!< io ioeration condition */
    uint8_t ioOPMinPwr;      /*!< min current in operation mode */
    uint8_t ioOPAvgPwr;      /*!< average current in operation mode */
    uint8_t ioOPMaxPwr;      /*!< max current in operation mode */
    uint8_t ioSBMinPwr;      /*!< min current in standby mode */
    uint8_t ioSBAvgPwr;      /*!< average current in standby mode */
    uint8_t ioSBMaxPwr;      /*!< max current in standby mode */

    uint16_t ioMinBandWidth;          /*!< io min transfer bandwidth */
    uint16_t ioOptimumBandWidth;      /*!< io optimum transfer bandwidth */
    uint16_t ioReadyTimeout;          /*!< timeout value from enalbe to ready */
    uint16_t ioHighCurrentAvgCurrent; /*!< the average peak current (mA)
                                      when IO operating in high current mode */
    uint16_t ioHighCurrentMaxCurrent; /*!< the max peak current (mA)
                                      when IO operating in high current mode */
    uint16_t ioLowCurrentAvgCurrent;  /*!< the average peak current (mA)
                                      when IO operating in lower current mode */
    uint16_t ioLowCurrentMaxCurrent;  /*!< the max peak current (mA)
                                      when IO operating in lower current mode */
} sdio_func_cis_t;

/*! @brief SD card CID register */
typedef struct _sd_cid
{
    uint8_t manufacturerID;                     /*!< Manufacturer ID [127:120] */
    uint16_t applicationID;                     /*!< OEM/Application ID [119:104] */
    uint8_t productName[SD_PRODUCT_NAME_BYTES]; /*!< Product name [103:64] */
    uint8_t productVersion;                     /*!< Product revision [63:56] */
    uint32_t productSerialNumber;               /*!< Product serial number [55:24] */
    uint16_t manufacturerData;                  /*!< Manufacturing date [19:8] */
} sd_cid_t;

/*! @brief SD card CSD register */
typedef struct _sd_csd
{
    uint8_t csdStructure;        /*!< CSD structure [127:126] */
    uint8_t dataReadAccessTime1; /*!< Data read access-time-1 [119:112] */
    uint8_t dataReadAccessTime2; /*!< Data read access-time-2 in clock cycles (NSAC*100) [111:104] */
    uint8_t transferSpeed;       /*!< Maximum data transfer rate [103:96] */
    uint16_t cardCommandClass;   /*!< Card command classes [95:84] */
    uint8_t readBlockLength;     /*!< Maximum read data block length [83:80] */
    uint16_t flags;              /*!< Flags in _sd_csd_flag */
    uint32_t deviceSize;         /*!< Device size [73:62] */
    /* Following fields from 'readCurrentVddMin' to 'deviceSizeMultiplier' exist in CSD version 1 */
    uint8_t readCurrentVddMin;    /*!< Maximum read current at VDD min [61:59] */
    uint8_t readCurrentVddMax;    /*!< Maximum read current at VDD max [58:56] */
    uint8_t writeCurrentVddMin;   /*!< Maximum write current at VDD min [55:53] */
    uint8_t writeCurrentVddMax;   /*!< Maximum write current at VDD max [52:50] */
    uint8_t deviceSizeMultiplier; /*!< Device size multiplier [49:47] */

    uint8_t eraseSectorSize;       /*!< Erase sector size [45:39] */
    uint8_t writeProtectGroupSize; /*!< Write protect group size [38:32] */
    uint8_t writeSpeedFactor;      /*!< Write speed factor [28:26] */
    uint8_t writeBlockLength;      /*!< Maximum write data block length [25:22] */
    uint8_t fileFormat;            /*!< File format [11:10] */
} sd_csd_t;

